app/controllers/products_controller.rb

  def index
  	#@products = Product.search(params[:search], params[:page])

  	@search = Product.search(params[:search])
---
SELECT * FROM `products`

  def edit
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `title` = 'Dalli Sensitiv', `shortd` = 'Універсальний рідкий миючий засіб для автоматичного та ручного прання як білої,так і кольорової білизни. Добре сприймається шкірою при надійній миючій здатності', `updated_at` = '2010-08-15 17:16:23' WHERE `id` = 2